import type { Prayer } from "./data";

export const TawassulPrayer: Prayer = {
    id: "dua-tawassul",
    title: "دعای توسّل",
    description: "دعای توسّل که برای طلب هر حاجت و شفاعت از ائمه معصومین (ع) خوانده می‌شود و از دعاهاى مشهور و معتبرى است که در کتب ادعیه نقل شده است.",
    icon: "hands-pray", 
    color: "#1A5F7A",    
    category: "Hajat",
    benefits: "علاّمه مجلسى (ره) از محمّد بن بابويه نقل کرده است که این دعا را در هیچ امری نخواندم مگر آنکه اثر اجابت را به زودی یافتم.",
    audio: 'https://static.ahlolbait.com/files/ahlolbait/old/download/doa_tavassol_farahmand.mp3',
    verses: [
        {
            id: "1",
            arabic: "اَللّهُمَّ اِنّى اَسْئَلُكَ وَاَتَوَجَّهُ اِلَيْكَ بِنَبِيِّكَ نَبِىِّ الرَّحْمَةِ مُحَمَّدٍ صَلَّى اللّهُ عَلَيْهِ وَآلِهِ",
            translation: "خدايا از تو مى خواهم و بسويت رو كنم بوسيله پيامبرت پيامبر رحمت محمد صلى الله عليه وآله"
        },
        {
            id: "2",
            arabic: "يا اَبَاالْقاسِمِ يا رَسُولَ اللّهِ يا اِمامَ الرَّحْمَةِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ",
            translation: "ای ابا القاسم اى رسول خدا اى پيشواى رحمت اى آقاى ما و سرور ما ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجتهاى خويش قرار دهيم اى آبرومند در نزد خدا براى ما نزد خدا شفاعت كن"
        },
        {
            id: "3",
            arabic: "يا اَبَا الْحَسَنِ يا اَميرَ الْمُؤْمِنينَ يا عَلِىَّ بْنَ اَبيطالِبٍ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ",
            translation: "اى اباالحسن اى اميرمؤ منان اى على بن ابيطالب اى حجت خدا بر خلق اى آقاى ما و سرور ما ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجت هاى خويش قرار داديم اى آبرومند نزد خدا شفاعت كن براى ما نزد خدا"
        },
        {
            id: "4",
            arabic: "يا فاطِمَةَ الزَّهْراَّءُ يا بِنْتَ مُحَمَّدٍ يا قُرَّةَ عَيْنِ الرَّسُولِ يا سَيِّدَتَنا وَمَوْلاتَنا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكِ اِلَى اللّهِ وَقَدَّمْناكِ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهَةً عِنْدَ اللّهِ اِشْفَعى لَنا عِنْدَ اللّهِ",
            translation: "اى فاطمه زهرا اى دختر محمد اى نور چشم پيغمبر اى بانوى ما و سرور ما ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجت هاى خويش قرار دهيم ای آبرومند پيش خدا شفاعت كن براى ما نزد خدا"
        },
        {
            id: "5",
            arabic: "يا اَبا مُحَمَّدٍ يا حَسَنَ بْنَ عَلِي اَيُّهَا الْمُجْتَبى يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ",
            translation: "اى ابا محمد اى حسن بن على اى برگزيده اى فرزند رسول خدا اى حجت خدا بر خلق اى آقاى ما و سرور ما ما روآورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجتهاى خود قرار دهيم اى آبرومند نزد خدا شفاعت كن براى ما پيش خدا"
        },
        {
            id: "6",
            arabic: "يا اَبا عَبْدِاللّهِ يا حُسَيْنَ بْنَ عَلِي اَيُّهَا الشَّهيدُ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ",
            translation: "اى ابا عبدالله اى حسين بن على اى شهيد (راه حق ) اى فرزند رسول خدا اى حجت بر خلق اى آقا و سرور ما ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجتهاى خود قرار دهيم اى آبرومند نزد خدا براى ما پيش خدا شفاعت كن"
        },
        {
            id: "7",
            arabic: "يا اَبَا الْحَسَنِ يا عَلِىَّ بْنَ الْحُسَيْنِ يا زَيْنَ الْعابِدينَ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ",
            translation: "ای ابا الحسن اى على بن الحسين اى زيور پرستش كنندگان اى فرزند رسول خدا اى حجت خدا بر خلق اى آقا و سرور ما ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو بدرگاه خدا و تو را پيش روى حاجتهاى خود قرار دهيم اى آبرومند نزد خدا شفاعت كن براى ما پيش خدا"
        },
        {
            id: "8",
            arabic: "يا اَبا جَعْفَرٍ يا مُحَمَّدَ بْنَ عَلِي اَيُّهَا الْباقِرُ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ",
            translation: "اى اباجعفر اى محمد بن على اى شكافنده علوم اى فرزند رسول خدا اى حجت خدا بر خلق اى آقا و سرور ما، ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجتهاى خويش قرار دهيم اى آبرومند نزد خدا شفاعت كن براى ما پيش خدا"
        },
        {
            id: "9",
            arabic: "يا اَبا عَبْدِ اللّهِ يا جَعْفَرَ بْنَ مُحَمَّدٍ اَيُّهَا الصّادِقُ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ",
            translation: "اى اباعبدالله اى جعفر بن محمد اى (امام ) صادق اى فرزند رسول خدا اى حجت خدا بر خلق اى آقاى ما و سرور ما ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجتهاى خويش قرار داديم اى آبرومند پيش خدا شفاعت كن براى ما نزد خدا"
        },
        {
            id: "10",
            arabic: "يا اَبَا الْحَسَنِ يا مُوسَى بْنَ جَعْفَرٍ اَيُّهَا الْكاظِمُ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ",
            translation: "اى ابا الحسن اى موسى بن جعفر اى كاظم اى فرزند رسول خدا اى حجت خدا بر خلق اى آقاى ما و سرور ما، ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو بدرگاه خدا و تو را پيش روى حاجتهاى خويش قرار داديم اى آبرومند نزد خدا شفاعت كن براى ما پيش خدا"
        },
        {
            id: "11",
            arabic: "يا اَبَا الْحَسَنِ يا عَلِىَّ بْنَ مُوسى اَيُّهَا الرِّضا يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ",
            translation: "ای ابا الحسن اى على بن موسى اى (حضرت ) رضا اى فرزند رسول خدا اى حجت خدا بر خلق اى آقا و سرور ما ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجتهاى خويش قرار داديم اى آبرومند نزد خدا شفاعت كن براى ما پيش خدا"
        },
        {
            id: "12",
            arabic: "يا اَبا جَعْفَرٍ يا مُحَمَّدَ بْنَ عَلِي اَيُّهَا التَّقِىُّ الْجَوادُ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ",
            translation: "اى ابا جعفر اى محمد بن على اى حضرت تقى جواد اى فرزند رسول خدا اى حجت خدا بر خلق اى آقا و سرور ما ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو بدرگاه خدا و تو را پيش روى حاجتهاى خويش قرار داديم اى آبرومند نزد خدا شفاعت كن براى ما نزد خدا"
        },
        {
            id: "13",
            arabic: "يا اَبَا الْحَسَنِ يا عَلِىَّ بْنَ مُحَمَّدٍ اَيُّهَا الْهادِى النَّقِىُّ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ",
            translation: "اى ابا الحسن اى على بن محمد اى حضرت هادى نقى اى فرزند رسول خدا اى حجت خدا بر خلق اى آقاى ما و سرور ما ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو بدرگاه خدا و تو را پيش روى حاجت هاى خويش قرار داديم اى آبرومند نزد خدا شفاعت كن براى ما نزد خدا"
        },
        {
            id: "14",
            arabic: "يا اَبا مُحَمَّدٍ يا حَسَنَ بْنَ عَلِي اَيُّهَا الزَّكِىُّ الْعَسْكَرِىُّ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ",
            translation: "اى ابا محمد اى حسن بن على اى زكى عسكرى اى فرزند رسول خدا اى حجت خدا بر خلق اى آقاى ما و سرور ما ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو بدرگاه خدا و تو را پيش روى حاجت هاى خويش قرار داديم اى آبرومند نزد خدا شفاعت كن براى ما نزد خدا"
        },
        {
            id: "15",
            arabic: "يا وَصِىَّ الْحَسَنِ وَالْخَلَفَ الْحُجَّةَ اَيُّهَا الْقاَّئِمُ الْمُنْتَظَرُ الْمَهْدِىُّ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ",
            translation: "اى وصى امام حسن عسكرى و يادگار شايسته و حجت اى امام قائم منتظر مهدى اى فرزند رسول خدا ای حجت خدا بر خلق اى آقا و سرور ما ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو بدرگاه خدا و تو را پيش روى حاجت هاى خويش قرار داديم اى آبرومند نزد خدا شفاعت كن براى ما پيش خدا"
        },
        {
            id: "16",
            arabic: "يا سادَتى وَمَوالِىَّ اِنّى تَوَجَّهْتُ بِكُمْ اَئِمَّتى وَعُدَّتى لِيَوْمِ فَقْرى وَحاجَتى اِلَى اللّهِ وَتَوَسَّلْتُ بِكُمْ اِلَى اللّهِ وَاسْتَشْفَعْتُ بِكُمْ اِلَى اللّهِ فَاشْفَعُوا لى عِنْدَ اللّهِ وَاسْتَنْقِذُونى مِنْ ذُنُوبی عِنْدَ اللّهِ فَاِنَّكُمْ وَسيلَتى اِلَى اللّهِ وَبِحُبِّكُمْ وَبِقُرْبِكُمْ اَرْجُو نَجاةً مِنَ اللّهِ فَكُونُوا عِنْدَ اللّهِ رَجاَّئى يا سادَتى يا اَوْلِياَّءَ اللّهِ صَلَّى اللّهُ عَلَيْهِمْ اَجْمَعينَ وَلَعَنَ اللّهُ اَعْداَّءَ اللّهِ ظالِميهِمْ مِنَ الاْوَّلينَ وَالاْخِرينَ امينَ رَبَّ الْعالَمينَ",
            translation: "اى آقايان من و سرورانم من رو آوردم بوسيله شما پيشوايان و ذخيرگانم در روز ندارى و نيازمندى بدرگاه خدا و توسل جستم بوسيله شما به درگاه خدا و شفاعت جويى كردم بوسيله شما به درگاه خدا پس شفاعت كنيد براى من در پيشگاه خدا و از او بخواهيد مرا از گناهانم نجات دهد زيرا شماييد وسيله من به درگاه خدا و بوسيله دوستى و قرب به شما اميد نجات از خدا دارم پس شما هم مايه اميد من به درگاه خدا باشيد اى آقايان من اى اولياء خدا درود خدا بر همگى ايشان و خدا ستم كنندگان به ايشان را كه دشمنان خدا هستند از رحمت خويش دوركند چه آنهاكه گذشته اند و چه آنها كه پس از اين آيند آمين رب العالمين"
        }
    ]
};